#**************************************************************************
#
# Copyright (c) 2004-2009 Oracle Corporation
#
# All rights reserved. This program and the accompanying materials
# are made available under the terms of the Eclipse Public License v1.0
# which accompanies this distribution, and is available at
# http://www.eclipse.org/legal/epl-v10.html
#
# Contributors: 
#
#    Kohsuke Kawaguchi, Eric Lefevre-Ardant
#        
#
#************************************************************************** 

grey=Le projet n''a jamais \u00E9t\u00E9 construit avant ou est d\u00E9sactiv\u00E9.
grey_anime=Le premier build du projet est en cours.
blue=Le dernier build s''est achev\u00E9 avec succ\u00E8s.
blue_anime=Le dernier build s''est achev\u00E9 avec succ\u00E8s. Un nouveau build est en cours.
yellow=Le dernier build s''est achev\u00E9 avec succ\u00E8s mais est instable. \
       Cela est utilis\u00E9 principalement pour repr\u00E9senter des \u00E9checs sur les tests.
yellow_anime=Le dernier build s''est achev\u00E9 avec succ\u00E8s mais est instable. Un nouveau build est en cours.
health-81plus=La sant\u00E9 du projet est au dessus de 80%. Vous pouvez passer votre souris au dessus de l''ic\u00F4ne du projet pour plus d''informations.
red=Le dernier build est en \u00E9chec.
red_anime=Le dernier build est en \u00E9chec. Un nouveau build est en cours.
health-61to80=La sant\u00E9 du projet est entre 60% et 80%. Vous pouvez passer votre souris au dessus de l''ic\u00F4ne du projet pour plus d''informations.
health-80plus=La stabilit\u00E9 du projet est d'au moins 80%. Placez la souris au-dessus de l''ic\u00F4ne du projet pour plus de d\u00E9tails.
health-41to60=La sant\u00E9 du projet est entre 40% et 60%. Vous pouvez passer votre souris au dessus de l''ic\u00F4ne du projet pour plus d''informations.
health-60to79=La stabilit\u00E9 du projet se situe entre 60% et 80%. Placez la souris au-dessus de l''ic\u00F4ne du projet pour plus de d\u00E9tails.
health-21to40=La sant\u00E9 du projet est entre 20% et 40%. Vous pouvez passer votre souris au dessus de l''ic\u00F4ne du projet pour plus d''informations.
health-40to59=La stabilit\u00E9 du projet se situe entre 40% et 60%. Placez la souris au-dessus de l''ic\u00F4ne du projet pour plus de d\u00E9tails.
health-00to20=La sant\u00E9 du projet est en dessous de 20%. Vous pouvez passer votre souris au dessus de l''ic\u00F4ne du projet pour plus d''informations.
health-20to39=La stabilit\u00E9 du projet se situe entre 20% et 40%. Placez la souris au-dessus de l''ic\u00F4ne du projet pour plus de d\u00E9tails.
health-00to19=La stabilit\u00E9 du projet est de moins de 20%. Placez la souris au-dessus de l''ic\u00F4ne du projet pour plus de d\u00E9tails.

