#**************************************************************************
#
# Copyright (c) 2004-2009 Oracle Corporation
#
# All rights reserved. This program and the accompanying materials
# are made available under the terms of the Eclipse Public License v1.0
# which accompanies this distribution, and is available at
# http://www.eclipse.org/legal/epl-v10.html
#
# Contributors: 
#
#    Kohsuke Kawaguchi, Eric Lefevre-Ardant
#        
#
#************************************************************************** 

title=Statistiques de l''utilisation du syst\u00E8me: {0}
Timespan=Dur\u00E9e
Short=Courte
Medium=Moyenne
Long=Longue
blurb=\
  Les statistiques d''utilisation du syst\u00E8me permettre de garder trace de trois m\u00E9triques de mesure de la charge: \
  <dl> \
    <dt>Nombre total d''ex\u00E9cuteurs</dt> \
    <dd>\
      Pour un ordinateur, il s''agit du nombre d''ex\u00E9cuteurs de cet ordinateur. \
      Pour un libell\u00E9, cela correspond \u00E0 la somme des ex\u00E9cuteurs sur tous les ordinateurs poss\u00E9dant ce libell\u00E9. \
      Pour Hudson, il s''agit de la somme de tous les ex\u00E9cuteurs disponibles sur tous les ordinateurs rattach\u00E9s \u00E0 cette installation de Hudson. \
      En dehors des changements de configuration, cette valeur peut \u00E9galement changer quand les esclaves se d\u00E9connectent. \
    </dd> \
    <dt>Nombre d''ex\u00E9cuteurs occup\u00E9s</dt> \
    <dd>\
      Cette ligne donne le nombre d''ex\u00E9cuteurs (parmi ceux compt\u00E9s ci-dessus) \
      qui s''occupent des builds. Le ratio de ce nombre avec le nombre total d''ex\u00E9cuteurs \
      donne l''utilisation des ressources. Si tous vos ex\u00E9cuteurs sont occup\u00E9s pendant une \
      p\u00E9riode prolong\u00E9e, pensez \u00E0 ajouter plusieurs d''ordinateurs \u00E0 votre cluster Hudson.\
    </dd>\
    <dt>Longueur de la file d''attente</dt>\
    <dd>\
      C''est le nombre de jobs qui sont dans la file des builds, en attente d''un ex\u00E9cuteur \
      disponible (respectivement pour cet ordinateur, pour ce libell\u00E9 ou pour Hudson en g\u00E9n\u00E9ral). \
      Cela n''inclue pas les jobs qui sont dans la 'p\u00E9riode silencieuse' (quiet period ou p\u00E9riode \
      de d\u00E9lai), ni les jobs qui sont dans la file \u00E0 cause de builds pr\u00E9c\u00E9dents toujours en cours. \
      Si cette ligne d\u00E9passe 0, cela signifie que Hudson pourra lancer plus de builds en ajoutant des ordinateurs. \
    </dd>\
  </dl>\
  Ce graphe est une moyenne glissante exponentielle de donn\u00E9es collect\u00E9es p\u00E9riodiquement. \
  Les p\u00E9riodes de mise \u00E0 jour sont respectivement toutes les 10 secondes, toutes les minutes \
  et toutes les heures.
