#**************************************************************************
#
# Copyright (c) 2004-2009 Oracle Corporation
#
# All rights reserved. This program and the accompanying materials
# are made available under the terms of the Eclipse Public License v1.0
# which accompanies this distribution, and is available at
# http://www.eclipse.org/legal/epl-v10.html
#
# Contributors: 
#
#    Kohsuke Kawaguchi
#        
#
#************************************************************************** 

title=Estad\u00EDsticas de carga: {0}
blurb=\
  Las estad\u00EDsticas de carga hacen un seguimiento de la m\u00E9trica de utilizaci\u00F3n de recursos:\
  <dl> \
    <dt>N\u00FAmero total de ejecutores</dt> \
    <dd>\
      Para un ordenador: es el numero de ejecutores para cada m\u00E1quina. \
      Para una etiqueta: es la suma de todos los ejecutores que comparten la etiqueta. \
      Para todo Hudson: es la suma de todos los ejecutores de la instalaci\u00F3n de Hudson. \
      Este n\u00FAmero cambia no s\u00F3lo por cambios en la configuraci\u00F3n, sino adem\u00E1s cuando hay nodos que se ponen fuera de l\u00EDnea. \
    </dd> \
    <dt>N\u00FAmero de ejecutores ocupados</dt> \
    <dd>\
      Esta l\u00EDnea representa el n\u00FAmero de ejecutores, entro los contabilizados arriba, que est\u00E1n procesando trabajos. \
      El ratio de estos entre el total representa el rango de utilizaci\u00F3n de recursos. \
      Si todos los ejecutores estan ocupados durante mucho tiempo, considera la opci\u00F3n de a\u00F1adir m\u00E1s nodos. \
    </dd>\
    <dt>Tama\u00F1o de la cola</dt>\
    <dd>\
      Este es el numero de tareas que estan en la cola esperando por un ejecutor libre \
      bien sea en este nodo, en esta etiqueta o en este Hudson. \
      El n\u00FAmero no incluye trabajos que estan en el periodo de gracia ni aquellos que estan en la \
      cola porque hay ejecuciones del mismo proyecto activas. \
      Si esta l\u00EDnea supera el cero, significa que este Hudson podr\u00EDa ejecutar mas trabajos a\u00F1adiendo \
      m\u00E1s nodos.\
    </dd>\
  </dl>\
  El gr\u00E1fico es exponencial calculando medias de los datos recogidos peri\u00F3dicamente. \
  Se hacen tomas de datos de 3 tipos: cada 10 segundos, cada minuto y cada hora, para los valores de intervalo peque\u00F1o, mediano y grande respectivamente.

Short=Peque\u00F1o
Long=Grande
Timespan=Visualizar datos para valores de intervalo:
Medium=Mediano
Load\ statistics\ graph=Cargar gr\u00E1fico de estad\u00EDsticas
