#**************************************************************************
#
# Copyright (c) 2004-2010 Oracle Corporation
#
# All rights reserved. This program and the accompanying materials
# are made available under the terms of the Eclipse Public License v1.0
# which accompanies this distribution, and is available at
# http://www.eclipse.org/legal/epl-v10.html
#
# Contributors: 
#
#    Alan Harder, Simon Wiest
#        
#
#************************************************************************** 

Error=Fehler
Manage\ Old\ Data=Veraltete Daten verwalten
Name=Name
No\ old\ data\ was\ found.=Keine veralteten Daten gefunden.
Resave\ data\ files\ with\ structure\ changes\ no\ newer\ than\ Hudson=\
  Aktualisiere Dateien mit Struktur\u00E4nderungen nicht aktueller als Hudson
Type=Typ
Unreadable\ Data=Nicht-lesbare Daten
Discard\ Unreadable\ Data=Nicht-lesbare Daten entfernen
Upgrade=Aktualisieren
Version=Version
blurb.1=\
  \u00C4ndert sich die Struktur von Konfigurationsdateien, geht Hudson folgenderma\u00DFen vor: \
  Dateien werden beim Einlesen in den Speicher in das neue Datenformat migriert, aber \
  nicht automatisch auf Festplatte zur\u00FCckgeschrieben. Die Konfigurationsdateien bleiben also \
  unver\u00E4ndert. Dies erm\u00F6glicht bei Problemen ein Hudson-Downgrade zu einer fr\u00FCheren \
  Version. Auf der anderen Seite k\u00F6nnen dadurch Dateien endlos in l\u00E4ngst veralteten \
  Formaten verbleiben. Die folgende Tabelle zeigt Dateien, die veraltete Strukturen verwenden, \
  sowie die Hudson-Version(en), in denen die Datenstruktur ver\u00E4ndert wurde.
blurb.2=\
  Beim Einlesen von Konfigurationsdateien k\u00F6nnen Fehler auftreten, z.B. wenn ein Plugin \
  Daten hinzuf\u00FCgt und sp\u00E4ter deaktiviert wird, wenn kein Migrationscode f\u00FCr Struktur\u00E4nderungen \
  geschrieben wurde oder Hudson auf eine \u00E4ltere Version zur\u00FCckgesetzt wird, nachdem die neuere \
  Version bereits Dateien mit einer neuen Struktur geschrieben hatte. Diese Fehler werden beim \
  Hochfahren von Hudson zwar protokolliert, die nicht-lesbaren Daten werden aber einfach \
  \u00FCbersprungen, damit Hudson trotzdem starten und arbeiten kann.
blurb.3=\
  Mit der untenstehenden Funktion k\u00F6nnen Sie diese Datein im aktuellen Format neu abspeichern. \
  Damit entf\u00E4llt die M\u00F6glichzeit, auf eine \u00E4ltere als die ausgew\u00E4hlte Hudson-Version zur\u00FCckzukehren. \
  Auch wenn Sie Konfigurationen bestehender Jobs \u00E4ndern, werden diese Daten im neuen \
  Format gespeichert, was ein sp\u00E4teres Downgrade ausschlie\u00DFt. Nicht-lesbare Daten, die in der \
  Tabelle rechts dargestellt sind, werden bei der Aktualisierung dauerhaft entfernt.  
blurb.4=\
  Langfristig wird Migrationscode zum Lesen veralteter Datenformate auch wieder entfernt werden. \
  Die Kompatibilit\u00E4t wird mindestens 150 Releases nach \u00C4nderung des Datenformates gew\u00E4hrleistet. \
  Versionen, die noch \u00E4lter sind, werden fett dargestellt. Es wird emfohlen, diese Dateien neu \
  abzuspeichern.
blurb.5=\
  (ein Downgrade bis zur ausgew\u00E4hlten Version k\u00F6nnte immer noch m\u00F6glich sein) 
blurb.6=\
  Nicht-lesbare Daten stellen kein Problem dar, da Hudson sie einfach ignoriert. \
  Um jedoch lange Protokolle mit zahlreichen Warnungen w\u00E4hrend des Hochfahrens von Hudson zu \
  vermeiden, k\u00F6nnen Sie nicht-lesbare Daten dauerhaft entfernen, indem Sie diese \u00FCber die \
  untenstehende Funktion neu abspeichern lassen.
